src/Documents/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СтатусыЗаявок</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УправлениеСтатусомЗаявок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСправочник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/УправлениеСтатусомЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УправлениеСтатусомЗаявок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЛистОжидания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СтатусыЗаявок/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Если СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая Тогда
			СменитьРодителя("Заявители");
		ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявок.ВЛистОжидания Тогда
			СменитьРодителя("Лист ожидания");
		ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявок.Отклонено Тогда
			СменитьРодителя("Отказ");
		ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			СменитьРодителя("Клиенты");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправлениеСтатусомЗаявок.ИсточникЗаявки КАК ИсточникЗаявки
		|ИЗ
		|	РегистрСведений.УправлениеСтатусомЗаявок КАК УправлениеСтатусомЗаявок
		|ГДЕ
		|	УправлениеСтатусомЗаявок.СсылкаНаКонтрагента = &СсылкаНаКонтрагента";
		
		Запрос.УстановитьПараметр("СсылкаНаКонтрагента", Контрагент);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ИсточникЗаявки = ВыборкаДетальныеЗаписи.ИсточникЗаявки;
		КонецЦикла;
		
		ДатаДокумента = ЭтотОбъект.Дата + 1;
		
		Движения.УправлениеСтатусомЗаявок.Записывать = Истина;
		Движение = Движения.УправлениеСтатусомЗаявок.Добавить();
		Движение.Дата = ДатаДокумента;
		Движение.СсылкаНаКонтрагента = Контрагент;
		Движение.ИсточникЗаявки = ИсточникЗаявки;
		Движение.СтатусЗаявки = СтатусЗаявки;
		Движение.Период = ДатаДокумента;
	Иначе
		Отказ = Истина;
		Сообщить("Контрагент не найден!");
	КонецЕсли;
	
КонецПроцедуры

Процедура СменитьРодителя(ИмяНовойГруппы)
	
    Элемент = ЭтотОбъект.Контрагент.ПолучитьОбъект();
    НоваяГруппа = Справочники.Контрагенты.НайтиПоНаименованию(ИмяНовойГруппы);
    
    Если Не НоваяГруппа.Пустая() Тогда
        Элемент.Родитель = НоваяГруппа;
        Попытка
            Элемент.Записать();
            Сообщить("Родитель изменён на: " + ИмяНовойГруппы);
        Исключение
            Сообщить("Ошибка записи: " + ОписаниеОшибки());
            Отказ = Истина;
        КонецПопытки;
    Иначе
        Сообщить("Группа '" + ИмяНовойГруппы + "' не найдена!");
        Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		Контрагент = ДанныеЗаполнения.Ссылка; 
		Комментарий = ДанныеЗаполнения.Комментарий;
	КонецЕсли;

КонецПроцедуры
